{
  "id":2,
  "name": "ReactJS: Hello, world!",
  "desc": "Bắt đầu với React nào mọi người ơi!!!",
  "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcQPrw9Zx5Qt-5JK73Cxzulbo9DTrgT-844NNQ&usqp=CAU",
  "content": [
    "<h2>Hello World</h2>",
    "<p>Đây là một ví dụ về React cơ bản nhất :v</p>",
    "<pre>",
    "ReactDOM.render(",
    "&emsp;&lt;h1&gt;Hello, world!&lt;/h1&gt;,",
    "&emsp;document.getElementById('root')",
    ");",
    "</pre>",
    "<p>Đoạn code trên sẽ hiển thị \"Hello, world!\" trên page.</p>",
    "<p>Hãy thoải mái thay đổi code trên nền tảng trực tuyến tại <a href=\"https://codepen.io/pen?&editable=true&editors=0010\" target=\"_blank\">Codepen</a></p>",
    "<h2>Đọc hướng dẫn</h2>",
    "<p>Trong hướng dẫn này chúng ta sẽ cùng nhau xây dựng một React apps: elements và components. Sau khi thành thạo chúng ta có thể xây dựng các ứng dụng phức tạp từ những thứ nhỏ hơn để tái sử dụng.</p>",
    "<div class=\"danger\">",
    "<p><strong>Tip!</strong> Tài liệu này được thiết kế cho những người thích học các khái niệm từng bước một. Nếu bạn thích học bằng cách làm hãy xem hướng dẫn thực tế sau: <a href=\"https://reactjs.org/tutorial/tutorial.html\" target=\"_blank\">React tutorial</a>.</p>",
    "</div>",
    "<p>Đây là chương trình đầu tiên trong hướng dẫn từng bước về các khái niệm React chính. Mỗi chương trong hướng dẫn này được xây dựng dựa trên kiến thức từ các chương trước đó. Vì vậy bạn cần xem bài viết bắt đầu trước tiên để có thể hiểu hết về React sau khi kết thúc tài liệu này.</p>",
    "<h2>Kiến thức cần có</h2>",
    "<p>React được xây dựng từ JavaScript, và do đó chúng ta cần có hiểu biết cơ bản về ngôn ngữ này. Nếu bạn cảm thấy không tự tin lắm, chúng tôi khuyên bạn nên xem qua hướng dẫn JavaScript lại nhé (bow). Bạn có thể mất chút thời gian nhưng điều đó giúp bạn tiếp cận với React dễ dàng hơn.</p>",
    "<div class=\"danger\">",
    "<p><strong>Note!</strong> Hướng dẫn này đôi khi sử dụng một số cú pháp JavaScript mới. Nếu bạn không làm việc với JavaScript trong thời gian qua tôi nghĩ nó cũng sẽ hữu ích giúp bạn học hiệu quả hơn (hiểu hơn về một số cú pháp mới trong JavaScript).</p>",
    "</div>",
    "<h2>Bắt đầu nào!</h2>",
    "<p>Chúng ta sẽ cùng nhau tìm hiểu về <a href=\"#/posts/3\">Introducing JSX</a></p>",
    "<p>Bài viết được dịch từ <a href=\"https://reactjs.org/docs/hello-world.html\" target=\"_blank\">ReactJs Hello World</a>. Trong bài viết có một vài chỗ dịch đã thay đổi do cấu trúc của web mong các bạn thông cảm.</p>"
  ]
}
